// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Configurações de servidor proxy";
HSDTaskDescription = "A impressora suporta conexão com a Internet. Se você usar um servidor proxy para se conectar à Internet, defina as configurações abaixo.";
TaskDescriptionInAssistantMode = "Para se conectar aos Serviços da Web HP, sua impressora precisa estar conectada à Internet. Se você usa o servidor proxy para se conectar à Internet, insira as configurações abaixo.\n\nSe você não sabe quais são as configurações de proxy, consulte as configurações no painel de preferências de Rede ou entre em contato com seu administrador de sistema.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Um servidor proxy não é necessário para se conectar à Internet";
HSDAutomaticProxySettingsTitle = "Automático (o dispositivo detecta as configurações automaticamente)";
HSDCustomProxySettingsTitle = "Configuração personalizada de servidor proxy:";
HSDSystemProxySettingsTitle = "Copiar configurações do sistema";

// Proxy server settings
HSDProxyServerTitle = "Servidor proxy:";
ProxyPortTitle = "Porta de proxy:";

// Authentication
HSDRequiresAuthenticationButton = "O servidor proxy requer autenticação";
HSDUserNameTitle = "Nome de usuário:";
HSDPasswordTitle = "Senha:";

HSDApplyNowButtonTitle = "Aplicar agora";

// progress titles
UpdateInformationProcessTitle = "Atualizando informações...";

// alerts
EmptyProxyServerOrPortErrorText = "O servidor proxy e a porta proxy precisam ser especificados.";

EmptyUserNameOrPasswordErrorText = "A autenticação de servidor proxy requer que o nome de usuário e a senha sejam especificados.";

IncorrectProxyServerNameFormatErrorText = "Falha ao definir nome do servidor proxy. Verifique se o formato é válido.";

HSDUserNameTooLargeErrorText = "O nome de usuário é muito grande. O dispositivo suporta no máximo %d caracteres em um nome de usuário.";
